Revit 2027 API
RevitLinkOperations Class
 This class is used to extend the IExternalResourceServer interface with methods to support operations specifically related to Revit links.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.LinkOperations
 Autodesk.Revit.DB.RevitLinkOperations
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class RevitLinkOperations : LinkOperations
Public Class RevitLinkOperations
	Inherits LinkOperations
public ref class RevitLinkOperations : public LinkOperations
type RevitLinkOperations =
    class
        inherit LinkOperations
    end
The RevitLinkOperations type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from LinkOperations)
Top
Methods
Name | Description
Dispose
(Inherited from LinkOperations)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetGetLocalPathForOpenCallback |  Sets the IGetLocalPathForOpenCallback that will support the "Open (and Unload)" command for Revit links obtained from an IExternalResourceServer.
SetOnLocalLinkSharedCoordinatesSavedCallback |  Sets the callback that will be called when the Revit user saves new shared coordinate settings to a linked document obtained from an IExternalResourceServer.
(Inherited from LinkOperations)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
The class owns single-method interfaces which are used as callbacks to perform specific operations on Revit link external resources.
An empty RevitLinkOperations instance is passed to an IExternalResourceServer (inside an ExternalResourceServerExtensions object) via the GetTypeSpecificServerOperations method. The server provider can then add their own implemented interface objects to the RevitLinkOperations, thus making them available to Revit to use as callbacks.
Supporting these additional, type-specific operations is not absolutely required, but is strongly recommended in order for users to be able to perform all the same operations they would with locally-accessed Revit links.
See Also
Reference
Autodesk.Revit.DB Namespace